{
"data": [
{
"id": 0,
"vendorTitle": "Featured Courses",
"title": "Oracle Certified Associate Java SE 8 Programmer I by Enthuware",
"img": "img/vendorCoursesImages/1Z0-808.png",
"courseObjective": "Prepare for the Oracle Java SE 8 Programmer I certification exam with the Oracle Certified Associate Java SE 8 Programmer I by Enthuware course. Interactive chapters comprehensively cover the Oracle Java 1Z0-808 exam objectives and provide knowledge in areas such as developing Java applications; mastering Java data types, operators and decision control structures; and understanding core Java APIs, encapsulations, and more.",
"lessons": 9,
"exercises": 145,
"quizzes": 111,
"flashcards": 121,
"glossary": 121,
"preAssessment": 70,
"tests": 6,
"postAssessment": 75,
"performance": 0,
"tutorials": 0,
"tutorialMinutes": 0,
"liveLab": 37,
"courseVideos": 29,
"videoMinutes": "01:28"
},
{
"id": 1,
"vendorTitle": "Featured Courses",
"title": "HTML5 Application Development Fundamentals",
"img": "img/vendorCoursesImages/98-375-2019_pro.png",
"courseObjective": "Prepare for the Microsoft MTA 98-375 certification exam with the HTML5 Application Development Fundamentals course and lab. The lab can be mapped to any course, textbook, or training, adding value and a hands-on component to training. The course and lab cover the MTA 98-375 exam objectives and provide skills required to manage the application life cycle, build the user interface (UI) by using HTML5, format the user interface by using Cascading Style Sheets (CSS), and code by using JavaScript.",
"lessons": 12,
"exercises": 0,
"quizzes": 100,
"flashcards": 75,
"glossary": 75,
"preAssessment": 60,
"tests": 2,
"postAssessment": 60,
"performance": 23,
"tutorials": 0,
"tutorialMinutes": 0,
"liveLab": 0,
"courseVideos": 153,
"videoMinutes": "07:26"
},
{
"id": 2,
"vendorTitle": "Featured Courses",
"title": "CompTIA Network+ N10-007 Pearson uCertify",
"img": "img/vendorCoursesImages/pearson-N10-007-complete.png",
"courseObjective": "Gear up to prepare for the CompTIA Network+ N10-007 exam with the CompTIA Network+ N10-007 course and performance-based labs. Performance-based labs simulate real-world, hardware, software & command line interface environments and can be mapped to any text-book, course & training. The cert guide offers interactive study material for the preparation of N10-007 certification exam and include topics such as network policies; network components; Ethernet technology; WANs; routing IP packets; IPv4 and IPv6 addresses, and many more.",
"lessons": 15,
"exercises": 0,
"quizzes": 144,
"flashcards": 385,
"glossary": 385,
"preAssessment": 132,
"tests": 2,
"postAssessment": 126,
"performance": 107,
"tutorials": 53,
"tutorialMinutes": "04:38",
"liveLab": 0,
"courseVideos": 197,
"videoMinutes": "21:21"
},
{
"id": 3,
"vendorTitle": "Featured Courses",
"title": "MTA Networking Fundamentals",
"img": "img/vendorCoursesImages/98-366.png",
"courseObjective": "Prepare and pass Microsoft MTA 98-366 exam with uCertify MTA Networking Fundamentals course. The course covers all the objectives of Microsoft MTA 98-366 exam that include understanding network infrastructures like concepts of Internet, intranet, extranet, LANs, WANs, wireless networking, and network topologies, understanding network hardware like switches, routers, and media types, and understanding protocols and services like OSI Model, IPv4, IPv6, networking services, and TCP/IP.",
"lessons": 16,
"exercises": 0,
"quizzes": 138,
"flashcards": 163,
"glossary": 163,
"preAssessment": 40,
"tests": 2,
"postAssessment": 40,
"performance": 50,
"tutorials": 50,
"tutorialMinutes": "00:49",
"liveLab": 0,
"courseVideos": 194,
"videoMinutes": "03:40"
}
]
}
